## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/20366497459)



<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * github_actions_variable.kyma_modules_runtime_internal_github_token_gcp_secret_name
  * google_secret_manager_secret.kyma_modules_runtime_internal_github_token
  * google_secret_manager_secret_iam_member.kyma_modules_update_components_workflow_internal_token_reader



<details><summary>Change Result (Click me)</summary>

```hcl

  # github_actions_variable.kyma_modules_runtime_internal_github_token_gcp_secret_name will be created
  + resource "github_actions_variable" "kyma_modules_runtime_internal_github_token_gcp_secret_name" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "kyma-modules"
      + updated_at    = (known after apply)
      + value         = "kyma-neighbors-runtime-serviceuser-internal-github-token"
      + variable_name = "KYMA_MODULES_RUNTIME_INTERNAL_GITHUB_TOKEN_GCP_SECRET_NAME"
    }

  # google_secret_manager_secret.kyma_modules_runtime_internal_github_token will be created
  + resource "google_secret_manager_secret" "kyma_modules_runtime_internal_github_token" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "component"                  = "kyma-modules"
          + "entity"                     = "kyma-neighbors-runtime-serviceuser"
          + "github-instance"            = "internal"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "neighbors"
          + "type"                       = "github-token"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "component"       = "kyma-modules"
          + "entity"          = "kyma-neighbors-runtime-serviceuser"
          + "github-instance" = "internal"
          + "owner"           = "neighbors"
          + "type"            = "github-token"
        }
      + name                  = (known after apply)
      + project               = "sap-kyma-prow"
      + secret_id             = "kyma-neighbors-runtime-serviceuser-internal-github-token"
      + terraform_labels      = {
          + "component"                  = "kyma-modules"
          + "entity"                     = "kyma-neighbors-runtime-serviceuser"
          + "github-instance"            = "internal"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "neighbors"
          + "type"                       = "github-token"
        }

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret_iam_member.kyma_modules_update_components_workflow_internal_token_reader will be created
  + resource "google_secret_manager_secret_iam_member" "kyma_modules_update_components_workflow_internal_token_reader" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-tools-sap/attribute.reusable_workflow_ref/kyma/kyma-modules/.github/workflows/update-components.yml@refs/heads/main"
      + project   = "sap-kyma-prow"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "kyma-neighbors-runtime-serviceuser-internal-github-token"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ service_account_keys_cleaner                   = {
      ~ service_account_keys_cleaner_cloud_run_service = {
            id                         = "locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-cleaner"
          ~ metadata                   = [
              ~ {
                  ~ effective_annotations = {
                      ~ "run.googleapis.com/operation-id"   = "61c66d4d-d6ee-4d90-a785-61930fc62f18" -> "2bc5def6-6929-424d-a790-3e5a1a9507b5"
                        # (5 unchanged attributes hidden)
                    }
                  ~ generation            = 287 -> 288
                  ~ resource_version      = "AAZFF8BdGGk" -> "AAZGMp8SVIg"
                    # (7 unchanged attributes hidden)
                },
            ]
            name                       = "service-account-keys-cleaner"
          ~ status                     = [
              ~ {
                  ~ latest_created_revision_name = "service-account-keys-cleaner-00287-4p7" -> "service-account-keys-cleaner-00288-g97"
                  ~ latest_ready_revision_name   = "service-account-keys-cleaner-00287-4p7" -> "service-account-keys-cleaner-00288-g97"
                  ~ observed_generation          = 287 -> 288
                  ~ traffic                      = [
                      ~ {
                          ~ revision_name   = "service-account-keys-cleaner-00287-4p7" -> "service-account-keys-cleaner-00288-g97"
                            # (4 unchanged attributes hidden)
                        },
                    ]
                    # (2 unchanged attributes hidden)
                },
            ]
            # (6 unchanged attributes hidden)
        }
        # (2 unchanged attributes hidden)
    }
  ~ service_account_keys_rotator                   = {
      ~ service_account_keys_rotator_cloud_run_service   = {
            id                         = "locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-rotator"
          ~ metadata                   = [
              ~ {
                  ~ effective_annotations = {
                      ~ "run.googleapis.com/operation-id"   = "c3cfb222-8f4a-4357-b042-80af55c6c5a0" -> "642ce867-4701-4d6b-be19-93e2aa2e73ee"
                        # (5 unchanged attributes hidden)
                    }
                  ~ generation            = 33 -> 34
                  ~ resource_version      = "AAZFF8Bcjao" -> "AAZGMp8F7Vo"
                    # (7 unchanged attributes hidden)
                },
            ]
            name                       = "service-account-keys-rotator"
          ~ status                     = [
              ~ {
                  ~ latest_created_revision_name = "service-account-keys-rotator-00033-ddn" -> "service-account-keys-rotator-00034-rng"
                  ~ latest_ready_revision_name   = "service-account-keys-rotator-00033-ddn" -> "service-account-keys-rotator-00034-rng"
                  ~ observed_generation          = 33 -> 34
                  ~ traffic                      = [
                      ~ {
                          ~ revision_name   = "service-account-keys-rotator-00033-ddn" -> "service-account-keys-rotator-00034-rng"
                            # (4 unchanged attributes hidden)
                        },
                    ]
                    # (2 unchanged attributes hidden)
                },
            ]
            # (6 unchanged attributes hidden)
        }
        # (3 unchanged attributes hidden)
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dev"
        name                   = "dev"
      ~ update_time            = "2025-12-18T03:25:55.797986Z" -> "2025-12-19T09:59:10.707314Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.dev_kyma_modules.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dev-kyma-modules"
        name                   = "dev-kyma-modules"
      ~ update_time            = "2025-12-18T02:54:59.043415Z" -> "2025-12-18T09:31:32.761066Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.docker_cache.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/cache"
        name                   = "cache"
      ~ update_time            = "2025-12-18T03:14:34.124386Z" -> "2025-12-19T09:55:00.767192Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dockerhub-mirror"
        name                   = "dockerhub-mirror"
      ~ update_time            = "2025-12-18T02:32:24.755327Z" -> "2025-12-19T09:53:39.264039Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.kyma_modules.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/kyma-modules"
        name                   = "kyma-modules"
      ~ update_time            = "2025-12-17T11:37:55.197273Z" -> "2025-12-19T08:15:36.673812Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/prod"
        name                   = "prod"
      ~ update_time            = "2025-12-18T03:28:14.414011Z" -> "2025-12-19T09:59:10.648106Z"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":13673,"Program":"tfcmt","SHA1":"e7918a4aabfb72db8d2a405c220b8123e34ba28b","Vars":{},"WorkflowName":"workflow-controller-pull-requests"} -->